# Tap - directory (and usually Git repository) of formulae, casks and/or external commands
tap "homebrew/services"
tap "akuity/tap"
tap "goreleaser/tap"

# Cask - Homebrew package definition that installs pre-compiled binaries built and signed by upstream
cask "bitwarden"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "goreleaser/tap/goreleaser"

# install newer version than /bin/zsh
brew "zsh"

brew "neovim", args: ["HEAD"]
brew "fzf"
brew "mise"
brew "age" # needed for fnox on occasion
brew "jq"
brew "fx"
brew "yq"
brew "gh"
brew "glow"

brew "stow" # used to symlink .dotfiles
brew "cmake"
brew "htop"
brew "pandoc"
brew "protobuf"
brew "telnet"
brew "nmap"
brew "curl"
brew "tmux"
brew "tree"
brew "coreutils"
brew "gettext" # GNU Gettext library and tools that are required for internationalization and localization
brew "gdb"

# K8s related packages
brew "argocd"
brew "kargo"
brew "doctl"
brew "dive"
brew "helm"
brew "kind"
brew "k3d"
brew "k9s"
