# Tap - directory (and usually Git repository) of formulae, casks and/or external commands
tap "homebrew/services"
tap "akuity/tap"
tap "goreleaser/tap"
tap "derailed/k9s"
tap "caarlos0/tap"

# Cask - Homebrew package definition that installs pre-compiled binaries built and signed by upstream
cask "ghostty"
cask "bitwarden"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "goreleaser/tap/goreleaser"

# install newer version than /bin/zsh
brew "zsh"

brew "neovim", args: ["HEAD"]
brew "fzf"
brew "mise"
brew "jq"
brew "fx"
brew "gh"
brew "glow" # Render markdown on the CLI, with pizzazz!
brew "gum"  # A tool for glamorous shell scripts.
brew "caarlos0/tap/timer"

brew "stow" # used to symlink .dotfiles
brew "cmake"
brew "htop"
brew "pandoc"
brew "protobuf"
brew "telnet"
brew "nmap"
brew "curl"
brew "wget"
brew "tmux"
brew "tree"
brew "sl"      # steam locomotive
brew "coreutils"
brew "gettext" # GNU Gettext library and tools that are required for internationalization and localization
brew "gdb"
brew "pinentry-mac"
brew "ykman"
brew "watch"

# K8s related packages
brew "argocd"
brew "kargo"
brew "doctl"
brew "dive"
brew "helm"
brew "kind"
brew "k3d"
brew "k9s"

# --- WORK ---

# Cask - Homebrew package definition that installs pre-compiled binaries built and signed by upstream

cask "kitty" # for using presenterm with larger text
cask "dozer"
cask "wizcli"
cask "windows-app"

# Tap - directory (and usually Git repository) of formulae, casks and/or external commands

# tap "env0/terratag"
# tap "koekeishiya/formulae"
# tap "nikitabobko/tap"
tap "hashicorp/tap"
tap "launchdarkly/tap"
tap "kreuzwerker/taps"

brew "act"
brew "git-filter-repo"
brew "postgresql@17"
brew "redis"
brew "mongosh"
brew "kreuzwerker/taps/m1-terraform-provider-helper"
brew "pre-commit"
brew "terminal-notifier"
brew "yamllint"
brew "jfrog-cli"

# Maybe junk?

# brew "unbound"
# brew "pango"
# brew "aom"
# brew "highlight"

# brew "libtiff"
# brew "little-cms2"
# brew "jpeg-xl"
# brew "apr-util"
# brew "glib"
# brew "freetds"
# brew "webp"
# brew "libavif"
# brew "gd"
# brew "libidn2"
# brew "gnutls"
# brew "harfbuzz"
# brew "librsvg"
